{
  "latestInLab": [
    {
      "date": "Apr' 25",
      "text": "Congratulation to Dr. Karuna Anna Sajeevan for making it to the finals in Biosolveit scientific challenge. You can read about it",
      "linkText": "here",
      "link": "https://www.biosolveit.de/scientific-challenge/project/?projectId=17397481065984",
      "icon": "fa-star"
    },
    {
      "date": "Feb' 25",
      "text": "Congratulation to Dr. Sakib Ferdous for successfully defending his PhD! We wish him all the best.",
      "icon": "fa-star"
    },
    {
      "date": "Oct' 24",
      "text": "Congratulation to Ella Salehi for passing qualification exam with flying colors.",
      "icon": "fa-star"
    },
    {
      "date": "Oct' 24",
      "text": "Congratulation to Md. Sakib Noor for passing qualification exam with flying colors.",
      "icon": "fa-star"
    },
    {
      "date": "Sep' 24",
      "text": "Congratulation to Bibek for defending his MS thesis in CBE.",
      "icon": "fa-star"
    },
    {
      "date": "Jul' 24",
      "text": "Prof. Chowdhury has been awarded the endowed chair position - 'Building A World of Difference Faculty Fellow'. Congratulations!",
      "icon": "fa-star"
    },
    {
      "date": "Jun' 24",
      "text": "Brisa Lopez Calderon joins as a IINSPIRE-LSAMP Summer REU from DMACC. Welcome Brisa!",
      "linkText": "IINSPIRE-LSAMP",
      "link": "https://www.iinspirelsamp.org/",
      "icon": "fa-user-plus"
    },
    {
      "date": "Mar' 24",
      "text": "Yee Chuen Teoh passed his MS thesis defense with flying colors. Congratulations!",
      "image": "images/Yee_MS_Thesis.jpg",
      "icon": "fa-star"
    },
    {
      "date": "Feb' 24",
      "text": "Hannah Gates, first year PhD student, is awarded the prestigious NSF Dependable Data Driven Discovery (D4) Research Fellowship for 2025 for her work on designing lanthanide binding proteins. Congratulations!",
      "icon": "fa-star"
    },
    {
      "date": "Oct' 23",
      "text": "Md. Sakib Noor, CBE PhD Candidate and Rahil Salehi, CBE PhB Candidate, joins the lab. Welcome Md. Sakib Noor and Rahil Salehi!",
      "icon": "fa-user-plus"
    },
    {
      "date": "Oct' 23",
      "text": "Congrats to Julia for receiving the Malcolm Family Scholarship, the Edward Henry Ohlsen Scholarship, and the Roderick Seward, Flossie Ratcliff, and Helen M. Galloway Foundation Scholarship.",
      "image": "images/awards_banquet_jyoung.jpg",
      "icon": "fa-star"
    },
    {
      "date": "Aug' 23",
      "text": "Bibek Acharya's work on structural analysis of protein pores for sensing, sequencing, and separations is now out in Cell Systems.",
      "linkText": "Cell Systems",
      "link": "https://www.cell.com/cell-systems/fulltext/S2405-4712(23)00211-9?_returnURL=https%3A%2F%2Flinkinghub.elsevier.com%2Fretrieve%2Fpii%2FS2405471223002119%3Fshowall%3Dtrue",
      "icon": "fa-star"
    },
    {
      "date": "May' 23",
      "text": "Sakib Ferdous successfully defended his MS in AI thesis. Congratulations!",
      "icon": "fa-star"
    },
    {
      "date": "May' 23",
      "text": "Congrats to Yee Chuen Teoh for bagging summer internship at Apple in the health team.",
      "icon": "fa-star"
    },
    {
      "date": "Jan' 23",
      "text": "Jack Girton is selected to present his research on Molecular Modeling of Nanovaccine Release for Colon Cancer at the National Conference for Undergraduate Research 2023 to be held at University of Wisconsin. Congratulations Jack!",
      "icon": "fa-star"
    },
    {
      "date": "Jan' 23",
      "text": "Jack Girton wins the prestigious Griswold Undergraduate Fellowship. Congratulations Jack!",
      "icon": "fa-star"
    },
    {
      "date": "Jan' 23",
      "text": "CBE Junior, Kaelie Hainlin joins the lab as a researcher. Welcome Kaelie!",
      "icon": "fa-user-plus"
    },
    {
      "date": "Jan' 23",
      "text": "First Year Honors students, Sophie, Naomi, and Julia join the lab as undergraduate researchers, We are excited to have you all.",
      "icon": "fa-user-plus"
    },
    {
      "date": "Oct' 22",
      "text": "Yee Chuen Teoh, MS Candidate, Computer Science, joins the lab. Welcome Yee!",
      "icon": "fa-user-plus"
    },
    {
      "date": "Oct' 22",
      "text": "Adele Haghighat Hoseini, PhD Candidate, Computer Science, joins the lab. Welcome Adele!",
      "icon": "fa-user-plus"
    },
    {
      "date": "Jul' 22",
      "text": "Jack Girton, CBE Sophomore joins the lab. Welcome Jack!",
      "icon": "fa-user-plus"
    },
    {
      "date": "Jul' 22",
      "text": "Bibek Acharya, CBE PhD student, joins the lab. Welcome Bibek!",
      "icon": "fa-user-plus"
    },
    {
      "date": "Jul' 22",
      "text": "Sakib Ferdous, Senior CBE PhD student, joins the lab. Welcome Sakib!",
      "icon": "fa-user-plus"
    },
    {
      "date": "Apr' 22",
      "text": "Iowa State will be home to the Chowdhury Lab from Fall 2022!",
      "icon": "fa-star"
    }
  ]
}
